
&НаКлиенте
Процедура ОК(Команда)
	
	Если Элементы.НазванияТаблиц.ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбран элемент");
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.НазванияТаблиц.ТекущиеДанные;
	
	Оповестить("УдалениеПриемаПищи",ТекущиеДанные.Значение);
	
	ЭтаФорма.Закрыть();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НазванияТаблиц") Тогда
		НазванияТаблиц = Параметры.НазванияТаблиц;
	КонецЕсли;
	
	Для Каждого ТекЗапись Из НазванияТаблиц Цикл
		ТекЗапись.Значение = СтрЗаменить(ТекЗапись.Значение,"Таблица","");
	КонецЦикла;
	
КонецПроцедуры
