
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаНаДокумент = ОбщиеФункцииНаКлиенте.ПолучитьДокументНаДатуНаКлиенте(ТекущаяДата());
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ПараметрыФормы = Новый Структура("Ключ",СсылкаНаДокумент);
		ОткрытьФорму("Документ.Питание.Форма.ФормаДокумента", ПараметрыФормы,  ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	Иначе
		ОткрытьФорму("Документ.Питание.Форма.ФормаДокумента", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры
