
&НаКлиенте
Процедура ПолучитьКоординаты(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ИмяПровайдера = "";
		
		ИскомыйПровайдер = Неопределено;
		Провайдеры = СредстваГеопозиционирования.ПолучитьПровайдеров();
		Для каждого Провайдер Из Провайдеры Цикл
		    Если НЕ Провайдер.Платный И Провайдер.ИспользуетСотовуюСеть Тогда
		        ИскомыйПровайдер = Провайдер;
		        Прервать;
		    КонецЕсли;
		КонецЦикла;
		Если ИскомыйПровайдер = Неопределено Тогда
		    Сообщить("Требуемый провайдер не обнаружен");
		Иначе
		    Сообщить("Найден провайдер: " + ИскомыйПровайдер.Имя);
			ИмяПровайдера = ИскомыйПровайдер.Имя;
		КонецЕсли;
			
		Координаты = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИмяПровайдера);
		Если Координаты = Неопределено ИЛИ ТекущаяДата()-Координаты.Дата > 3600 Тогда
		    СредстваГеопозиционирования.ОбновитьМестоположение(ИмяПровайдера, 60);
		    Координаты = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИмяПровайдера);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Координаты) Тогда
			ДанныеАдреса = ПолучитьАдресПоМестоположению(Координаты.Координаты);
			Адрес = ДанныеАдреса.Представление;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Адрес) И ЗначениеЗаполнено(Координаты) Тогда
			Адрес = Строка(Координаты.Координаты.Широта) + ";" + Строка(Координаты.Координаты.Долгота);
		КонецЕсли;
			
	#КонецЕсли
		
	
КонецПроцедуры
